{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Annual Report",
    "1": "Article",
    "2": "Blog Post",
    "3": "Brochure",
    "4": "Conference Paper",
    "5": "Government Report",
    "6": "Guide",
    "7": "Journal",
    "8": "Journal Article",
    "9": "Journal Issue",
    "10": "News",
    "11": "News Article",
    "12": "News Release",
    "13": "Questionnaire",
    "14": "Report",
    "15": "Research Paper",
    "16": "Survey Report",
    "17": "Technical Report",
    "18": "Transcript",
    "19": "University Admission Application Form",
    "20": "User Manual",
    "21": "White Paper",
    "22": "Whitepaper"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Annual Report": 0,
    "Article": 1,
    "Blog Post": 2,
    "Brochure": 3,
    "Conference Paper": 4,
    "Government Report": 5,
    "Guide": 6,
    "Journal": 7,
    "Journal Article": 8,
    "Journal Issue": 9,
    "News": 10,
    "News Article": 11,
    "News Release": 12,
    "Questionnaire": 13,
    "Report": 14,
    "Research Paper": 15,
    "Survey Report": 16,
    "Technical Report": 17,
    "Transcript": 18,
    "University Admission Application Form": 19,
    "User Manual": 20,
    "White Paper": 21,
    "Whitepaper": 22
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.41.1",
  "vocab_size": 30522
}
