{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Cryptography",
    "1": "Cybersecurity",
    "2": "Education",
    "3": "Environmental Policy",
    "4": "Finance, Economics",
    "5": "Global Health",
    "6": "Global Health Policy",
    "7": "HR, Diversity",
    "8": "Human Resources",
    "9": "Labor Market Trends",
    "10": "Legal Studies, Various Topics",
    "11": "Public Health",
    "12": "Sustainable Tourism",
    "13": "Technology, Mobile Devices"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Cryptography": 0,
    "Cybersecurity": 1,
    "Education": 2,
    "Environmental Policy": 3,
    "Finance, Economics": 4,
    "Global Health": 5,
    "Global Health Policy": 6,
    "HR, Diversity": 7,
    "Human Resources": 8,
    "Labor Market Trends": 9,
    "Legal Studies, Various Topics": 10,
    "Public Health": 11,
    "Sustainable Tourism": 12,
    "Technology, Mobile Devices": 13
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.41.1",
  "vocab_size": 30522
}
